node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 9270718
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "\251e\021\276\016G|>\024I\025\275\3363u>L\247\263<\204V`<S7\207\276\201\263\307<\2749\241=IGY>\230\217\334\275+i\217\273\213\252\'=Q>\033>\277K\025>\261\342\000>\262\003\014=\251\343\014\276\243#\372\2759\311`>\036z#=h\352^=\316\244\320=\264\357\016\275\021o\024\276\n\230\230\276\260\275\310\275\017\035[\275\307\207\025>!\0148>\252\0216<>j\265\274\"z8<\362\017\365<\343\317\333<\\O\276>m\232\224=&\365\246\275\347\004\330<\356\245\214=\320i\222<\273\373a=\024\341\006\275\224\255\260=\227\217\366=\022\031\206\275\245\244\221=\251\0032\276\202Qe\27540\232=\3376\316=\264\032\037\276,\3071\273\366\222\025>z9\014<\264\016\343=n\325m\276\t:^\275\270\267.>\341s`\275\370\224\346=\014\206\t\276\025\360*>X\002[;\347\364\272\275\351\320\222\274\310\013l>\372\275\3219\027\223\353\275\334\257T>\334dI>+\317\251\275\335\033\251\275\2300\324;\004\021\'\275\203\354c\274;\237\233<\250\237@=\235\210?\276\013\'\323=\317J\037>\317}\234\275\332f\212=\271n(>\035\376\276<h>J>\021H\370\275\215\315N\272\312V\031>3\277\365\275\023\005g=\353\\5\275\330\307\266\275\334\316\367\274&2\010\273|kV\274\231\2138\276uF\027=\303+\233>\005+\254\275\203\341\372<n\357c>\265\033\257\276\261\2606\276E\263\236\275\016\274\305<\010\240\235=\221v\323\275\224\271\275\274\241\364\220=>\372\222\2753\337\231\276\374V\240\274\177\331z\275\311\307\027>\355;\036>\r,+\276\200\217\307\274I\306\014>\n-l<\354:R=\231\254m>\024\216\221\276\017$l>\235\332\010>0{\033=\207\322\233<d\255\236\275\r~\257=\023!\364\274\207\373\035\275\037\362Z=\262F\036\274W\251\375\2747\302q>\023*\r\276\230\356>\275\312\277\'\276\202\305\315;\307\321\272\275X\306\360;{5X=g!\004\276\010~\202\274\303\302\234\275^\211`=k\316\014>\237\031\030>\034sz\275jSI\275\377\344\321\275\214]\341=\004\375\016\2723\035j\276\240\213\361=\205\026<\275\270$\307\275\265o\260=\251^Z\275\201+\375:\310\207X\276\357\331&>\236\316\273\276\225\357j8\t\034x=\254x\240\275\210\363v\276\2679\344\275\375\'0>t\253H>\303\273#\276T\277\371\274\\\345\346<\244\207]\276\010\2473\275\023\304b=x\322:>\244<\210<0\373\362<\316\250\201\275\324\035\237>\351w\341\275\332\367\027\276\211(\267\275\022\276\205\275\226\0001\276N\247_\275\t&\313:Yj\212=b\223t\275\346\205\000>\233\210\245<\013w\t\275\020\313\210\275\322L\270\275>\346\263=\267\360);\377\340\232\276i`\336\273\031\346\317=a2\334<\222b/>\346\371\241=\267\320\031\275\024\207\r\274>\2625\274\270\2111<W\344\215\274$\354W\275\345P\026\276L\230\027>\332\010\210\276\263\032\000\276\350\203P\276\366[\331\275\267Y7>\236=\\=\302\030D\276Oql\275\235\265,\274\245\224\\=V\212\023>\341\027\034>\307\206t>\227\220-\2762\245H>j\342\217\275\3600c\275\367\227I>\354\t\247\274\212\333\313=o`6\276:\361\022>\rU&\275-,=\274d\\\366=\004\177H>w\2369\276\335(\247\275\227Fo=D\250\301\274\246<\371\275\253&\224<\262\212\234\274\277A\211\274\'\270[=h\020)>\036<\205>\234b\234=O\201I=\273\262\027=\254\376?;3\230V\2767:=\275\024\234\335>\340I\006>c5B\275\352\013\246=\303\254\207\274\007\354\237<`\035O\276\337v\026>\333\364%>\207\203(>\202\274\330=%\245\301=V\306\367=u} >~$/\276\370\364\224=nl\370\274~\370\330=\374\t\000>\361\035\302\275\204\370\325\275\035\275\264>1\023\357\272f_?\275\332\353\250:\217\177)\276\2678x=\267\222\000<\001\020\345<\323\312`\276A\352\223:\304\340f=\370\024\362=\352\360\375;\361\037\032=P\326\r<K\275\250=%>D\274\312fp\273\360+y\275tb\006\276\025~\222\276Q\030\207<P\213\324\275\344\360\213\275\361\013\263\275\240\250\264\275\272\315\244\275\025\025\350=\272\277\017\276\373\223\316=v\311->b|\305=\266\330\024=\355\325\240=k\220\334=\031E\237\274\227\031&\275\021*\310<\371H\003\2769\242\023=\252/Q=E~b>W#\202\276%7\252=\317\237\036=\317\223\352\275\332K\013\274\317\002\220\276<\013\310\274k\311\325\276,\2676\275\354\004\000\275B\t\314<\267y:\276\321\276)\273\343\276S\275M\347\003=\234\203\320\274 \301\017\275\276\233\310\275n\254@\275J\021\360=\233\344L\276\305\020\225=\344/\003\276&0}\276\241\275\221=\201\t\303\275*\301\205\275\344\032\010<\357\021\340=\036?\215=\275\'\027>\247\013\207=m!.\275q\177\367=y\035N>(\311}\275\255\033/\275\3465\203>B\"\260=\303\355a\276\211:\325\275\007ec\275\205U\034>\321\342-\275\300\242\204=\235\274\006\275P\311\003>f\247&\276(\037\241\275[\234\272\275\214\020{>\365E\243\275\363\3366\276hi$>%}\240=\003\037\261=% \326\275\"\2553\275\361\333O\276\010\257~;IW[;\332B\305<\\\364\364\274z\270\302\274I\214\023\275\353\253C<\240\305\352<Q\314W\275\275\2648>5\317\322=\005\232W=\000\245\241=\355\255\315>M\345\020;\014\312\250=e\032\234\275\231\236\t<!\265\233>\253\216 =\240\244\027\276\216\347\333\275\r\206\005\275\355\002;=\240\035\303\275G\'\245=\320\000\204\274u\351\210\274\264%\037\274\016\001e>-8\221=\226n*\276w>\023\275\266\000\214\276e\004\357\275+\035\002<\355\271\222=\345\312\212= K\215\275\014|\365<\3448\020\276Cw\036\276\216+9\276?\'\241>\212\237\365<y}\227;\3128\214\274^_m>1\232\253;v\267\022>!\363\207\2751*\312\275<{\035>\256\035#>\211\203)>M)\253=\361\331\\\272e\264\203>\376X:\276\253\230\304\275\307Ng\275,\314\006>\327N\006<cN5\276(\254S<\033U\037=\245\207\226\276\014\021\304\275\366\237\203=,a\244\275\334\272q<\347\317==\256\rp\276\312:\204\275$Ip>&\272\013\276\323\260\323=G\301\034>h\026\210=\027\272\000>\326o{\276\305\\I\276H\331\013\275wn-\275P\244\330=\300F\r\276\362\021\033\275\334h\312\275\366\026\244<\031\362\024\276\001\016\210<!\325x=FET\275\247\303\n=\026\223\353=\245\003%\276\2510\000=\277\004@\276O*\307=\350\331%\2765\314\004\270\002\365G\276\312\220\000\276\272\2765>&HB=\372\024\002>fs\250=*\014\225\276\362\356\232\275m\030\010>\014\361\344\275\216i\212\276\370\232,>c\354\023\276\"\227s\275\000\361\025>\032\335Y\275\346\223\273<\250\337>=\326b\261<\034\304&>S\016\342=\323\356\000\276>\2401>\266r\312=\237\355!\275\224\263e\275>\277\332=\\8K;\031P-<\350D\366=\302\242\217<f\332v\274\r\376.\276\302\242\033>\3264o>.\037\306;\266\355\234>>X\246\275\"\231\373<x+\262\275\365S\321\274\353\352M\276\355\014\370\275\362L\233=\307F\335=\215\266#\275\033z\371\275c{_=\214\"X>Zd\323\275\325\021\252\276\223|\033>\317\327\002>D\0373\274\022\332\216=v\202\200=\303\373\035>\214;\241\275\207\302\331:\317f\017\275\035\205\360<\347!m\275\275\006\007>\351\255U>\365%\031\275\222\215\264=\327T\310\275j\225\020=#\352U=\276\363\346\275\327\216\023\274\206\351\002\275\232\004O>?h4\276\005\367\363=2\362\357\274D\026\255\2758\037\223\275S\211\310\275p\"O\276\"Q\250>\010\367\253\275\311\222\257=s\333\312\275\202\332u\276\333`\251=\021\236\322\274\366\307M\2769:]\275\221R\302=\376\363\376\275\3660_\276&\246\240>~\210\036<1\327\255\275\320\372\227\275\325\362\322<9\315\377\274\331\252\215=9Gj\276;\346\324;]\353g\274\242*M\275;\257Y\276\020\322%>\2606u=\321\3365=\327\t+\2762\222\013\275`\023,=\032\366\270=2v\364=\030\227\\=\037q\313=}\014\225=\026wV>\222\201\363\275W\215\311\275>\031\330=\214\363\311=4\312\324=\033\244%>\232\226\325\275w}y\275\270\360\200\276fk:=B\272.>\301\302G=\324\356\252;\343H\334<m.\214\275\315M\223>E\"o>d\372\312=\227\231\231\275Q\347s=(\031\357<[\376E=M\237\013\276%\253\003>\213\215b=qR\274>\334d~>\020ED\275\255\324\313\275\010dC\276\327={<\232\252\334\272\372l\347=*\r\242\275\017\232\272;\340\316\325;\235\322\312=gQ\024=/\\\016>E\335\352\274\340\211\301\275`\254\245=\351\023A<\370Zc\275\003N\355\274\2475v\274\242f\220\275{\375>>\260T\313<\235\t\267=\244nw= 9\334=\240\330\273=\n&\207\275]\377\354\275\366\233\315=\201\006q\276h\321\014=\360\023\350\275j\246\201\275\374\000\363=\347\364\001\274\220I\353=6eV>\n\352\227>i\372!\275\314\016\\\276\034\213\004\273\'z\333\274N\201\374\275_\360\253\275\273\345!=g1\236\274BTs=\3218N>c\253\272>\214u \275\201\375\020<\220G\310=\266\271\017\275@\327\312=\265r\332\276\207\262\017;\335H\357<Hb\321\275\244\222\236=,[\023=\340q\344\275\223\225\220\274?\316H>\270\371m<\211~V\275\251\n?\275\340\334\335=k\\\007\276\001{o;\326\301\225\275\'\202\346\275\243\237\">\207(\222\276\301\214\034\276KY,\274\031\260\207=\337\\\031\276\306\371E\274G\300\224\275\2772\234=\350G\016\275\007\r\027\276\247\225J\27571K\276E\327$>\223\376`=\315\2132>@A\376=J\230\212\275\233\253\225>\247\344\020\276RY\254\275\031\004\271<\210\250\252<j\206\263\275p1j<)7\372\275&\375\305=\220u\262\275)\020\237\275\227\317\001\275o$\300=\310\366=\275\006\263T\275<y\327\274\275x3>zo%\276@J4\276\275qx\275\202\241\266\275\335\276\030>\341/\"\275\376d@>\352\005\325=\023\325\227\275\252\201\\\275\242\344t=\373\013\344=\250;8\276,\023\311=\t\264T\276\350\253I>1F@\275@\263\231\275nj\n>\360\001\306>l\341h=@\rE<\246y0\276\244$;\275\'\031\006=\323B\364=\305\327\314<\226\352\231\275*V\271=\023\367\316=`\250:>\357\262\304=SL\200>\201\260\273=9EC\276R\000@\275\213\373\033>9\t5>\213/\277<\234\202L=\373\n\353=\253\354N=\275\275/>\224\373h=A(\206=\373;\373\275`\322%={}\313\275E\000\371<p\275\244<\267\371\206\276[B\000>\032al\275\301\336E\276{\267\t\276V]\022<d\222=\276\211\217j\275p\245`\275\215\037\203=\252->=\323/\310=\035[\r>\342uD>fZ\260\275\326\367o\275\3320\320\274\207}R>\\\t\303;xY\207=\030\025B\275P\300\\>\205Q\004>v@\240\274x+\014>\215\276f=\331\247\373\2750\312Q>D\024\320=k\221\372=\260j\236>$#\253=\352A\177>\210\323\214=\260\235\324<\313)`\276\347\253/\276\270\211u\275\207[Q\275\251\200\220=pl\372<\002\035!>\213\340 <\312\316m\275_Z\336\275\254\010\232\275S\215Q\274\250\021\332=\251\274\217\276R\377\366\272\347\222\202\276\273\017\265=v!^=\300\312\321=S\315\272=M(\">+\276\004\275n\321g>\020B\003>x\n\314=Q\303\024\276\2440\235\275\260\374\t\276=\253>=\301p/=\211\273K\275&%;\276\017\307T>#\371\332=P\237\005>|\357`\276*\024\233<Q\270S\276\030zc\276b9\033\276\021\223W\275\210&\364\274\004\020c<\240\260\274\274\276\316`>\017\211g<d\177:\276\027\355\203=\335\021X>z\367\263\275\324\213\220\275\343\027\322\275O\207\215\275\236\327?\275{\245\202>\026.u<\2740\021\274)\006\272=\3139\324=\n\324\256<*\257\177\276\3707\240\275F&_>\357\373\247\274\233\211g\275\356\353i\275\333P\216=\237-\023\274\302?\212\276\r\225|>\007\022\312<t\201\241\275s\017w\276\335\303\006<\273%\n>\254\322n\275X\202g>\307\234@\275sT\226=P\247\225=\007\242\002\275\244[\233<\363\327\361\275\026\321)\276\253\304\207<\024]\236\275\210G\343=\260\241\366\2748nV\275b\327\367\274\342\016\334\274\267\253\271<y(\210=\267\215\216\276\346\303/\276DW\266\275\266\332!\275S\354(\276\233%3\275\004TW=rp\371\2755\307\220\276\370\220\251=\027\030\367\275\377\272(\275+\221(>\205\207\236=\230Os=\315>\267=Vqw\274\014\335e:\367\243F\275\035\253\036>\211\302\217\276\231\262\306;c\310\246>\236\227,>\204\320/\276\007%\306=\262\020\007>|\231\031>TxO=}\327\233\275e\227\010\276\376\354\225\275\260\2273>\310`\003\275\341t\261=4\210\016=\031fO>\035j\332\275%S:\276\033\336\201>\261u\271=\251/\336\275\205\210\205=\025\355\363=\003O\213\275t\377\022>AC\267\274\026?(\275\346\275|\274H\341\336<[%%\276r\231\006=t\261\272= 76<\200\300\034>\337U\002>\233\005\025=`\335Z>\243Z\341=\\\277\276=\374\315\177>\310m\314\275\333\207\243\275\301\017~>x\202\324\275X\3528>\357\031\202\275\354\033\337<\257\302\304=\333\026f=+N\324\275\2266c\275Ek\244=?J\354\275\177\003\201\275\214\244\306=\234U\351\271\226\225_\275\206\326\231\275WE\002>\255\242w>\204Y7\275|)4>\340\356\007\276R\000\276\275\001\022\245=Nx\273\275\345\037M<\310m\026\2757\222\000>^L?\276\251\253\016\276\237\232\177=\000\217\237\275E\033\322>\317\352\351\275 J\270\272Ld\021\276\334\310\303=j\352\002\275\010m <5f\363=\361\317P=\350\003Z\276%*2>U\260\344=\237q\267\275\351\376]=4\313\014\276\n\372\331\274 \255r<\201\321>\275\267=\220>\374\225\246\275\332\245\243\275\022Ns=\222\037Q=\332\270\005>K\234\322=^\377/>\324{G\276\337P\246\275@\222!<\333\371\260=\266\311\356=(\361\314<?\201\022=&\354\025\276\236|\203\275\346|R\276\350\230\362\274d\3607>\300\203\303=\224\"\026\275]k\225\274\350]~=\301\301c\276\311\3073=\2011\347\275\024t\272=By|\2753Y\314=\324\024%\275\1775\220\276\267\243\214>\240t4\275\'\013\r>\010\000{=\306\003\216>)5\344=l@i=\243\313\310\275%_K\276\267\345\017=\032\020\002\276\260l\303\275i\257f\276\001[\276=@0\021>\376\271\360=\257\272\204\275\211\200n\276\233]\234=\254\353 >\027xA>c\3514>\233\272\325\275\205m\265\275_\177\242\275T\332\363=/J{\273O\303\363\275{\"\243=\372VS\275\366\"\315\275\207\"\035\2737\2667\275\312r\367\275\022\203\005\276\353ZA\276\nk\020>\r\371\257\275\312\356\365=\265\201/<\222\274t\275U\276\027\276\276\3536=):p\276Ex=\2769\345K>\312\252\207=o\035\016>&\t\010> \344\305=X\027O>\353\215v=)\361\367\274\246\017\023=)h.>VT\253\275}\260\355=\277\326Q;(j;\275\3003\374\272\315\205\241=\3776\325=ei\240\275\223\207\254\274\205pr<}\030\240>TVO>\367\023\234=\201\2342\276:c\361\275j7\242=\250\362\244=\003\207]\276\346\361\275\275\367fW\275\256\302\014>)\244\231>@\366a<\327]\377\274\265\223F;u\t&>\360\347\262=\351(\364=\002\224\251<\362i\301=2c\027\276\254\2377>\371\025\342=&\007\037>\206\260\004\275\370\356\025>\203\323\016>0\020D\276\363\241\263\276\277\rT\276p,!=K\315\315<\326]\252=T\305\241\275\3136\247<\246I\005>@\345X\276H\020\014>\301\215q;\037~\324<{[\231\273\261\017\252\274o\234\254\276\240|\241\274\250\002\000\276a\363\374\275$\035\010>\250^\252=\211h\355\274%\347\225\273\206\200\370=\003-\274=)\225t\275\252\002\351\275\3451\373=\\\251\306\274\356\"\220=3f;=N\034\205\2764wp>bI_\275\363\326\221\275ni\003\276\304}\036\275q\017\345\273E\272\265<\374\352<\275\341K\025\276\260_h<~3f=\247\026\225\275,ql\275\356\225\356\275\223\373j>\021\274\n\276\200\215\337=e\366r>,R\216=\305\217%>\355\3700\275\032\330?>37\333\275\362\216\261\2741\3531\274C\347\226<\221\272_>s4)="
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/Shape_1"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_11/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/strided_slice_11/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_11/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_11"
  op: "StridedSlice"
  input: "net/Shape_1"
  input: "net/strided_slice_11/stack"
  input: "net/strided_slice_11/stack_1"
  input: "net/strided_slice_11/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/Shape_2"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_12/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_12/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_12/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_12"
  op: "StridedSlice"
  input: "net/Shape_2"
  input: "net/strided_slice_12/stack"
  input: "net/strided_slice_12/stack_1"
  input: "net/strided_slice_12/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones/mul"
  op: "Mul"
  input: "net/strided_slice_12"
  input: "net/strided_slice_11"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones/Less/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1000
      }
    }
  }
}
node {
  name: "net/ones/Less"
  op: "Less"
  input: "net/ones/mul"
  input: "net/ones/Less/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones/packed"
  op: "Pack"
  input: "net/strided_slice_12"
  input: "net/strided_slice_11"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "net/ones/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones"
  op: "Fill"
  input: "net/ones/packed"
  input: "net/ones/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
